Белгипрозем_2017/src/Catalogs/СпискиРассылкиПоКорреспондентам/СпискиРассылкиПоКорреспондентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпискиРассылкиПоКорреспондентам</name>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКорреспондентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/СпискиРассылкиПоКорреспондентам/ManagerModule.bsl
// Заполняет переданный дескриптор доступа 

Функция ПолучитьПоляДоступа() Экспорт
	
	Возврат 
		"ГруппаДоступа,
		|Получатели";
	
КонецФункции

Процедура ЗаполнитьДескрипторДоступа(ОбъектДоступа, ДескрипторДоступа) Экспорт
	
	Если ЗначениеЗаполнено(ОбъектДоступа.ГруппаДоступа) Тогда
		Строка = ДескрипторДоступа.Корреспонденты.Добавить();
		Строка.ГруппаДоступа = ОбъектДоступа.ГруппаДоступа;
	КонецЕсли;
	
	// Корреспонденты
	Если ТипЗнч(ОбъектДоступа) = Тип("Структура") Тогда
		Выборка = ОбъектДоступа.Получатели.Выбрать();
		Пока Выборка.Следующий() Цикл
			Строка = ДескрипторДоступа.Корреспонденты.Добавить();
			Строка.ГруппаДоступа = ОбщегоНазначения.ПолучитьЗначениеРеквизита(
				Выборка.Получатель,
				"ГруппаДоступа");
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТаблЧасти Из ОбъектДоступа.Получатели Цикл
			Строка = ДескрипторДоступа.Корреспонденты.Добавить();
			Строка.ГруппаДоступа = ОбщегоНазначения.ПолучитьЗначениеРеквизита(
				СтрокаТаблЧасти.Получатель,
				"ГруппаДоступа");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
